run/flat_plate_ext_graded/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)	// 0
    (1 0 0)	// 1
    (1 1 0)	// 2
    (0 1 0)	// 3
    (0 0 0.1)	// 4
    (1 0 0.1)	// 5
    (1 1 0.1)	// 6
    (0 1 0.1)	// 7

// new points

    (2 0 0)	// 8
    (2 1 0)	// 9
    (2 0 0.1)	// 10
    (2 1 0.1)	// 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (0.2 5 1)	// block #1
    hex (1 8 9 2 5 10 11 6) (20 20 1) simpleGrading (6 5 1)	// block #2
);

edges
(
);

boundary
(
    zeroGradPlanes

    {
        type patch;
        faces
        (
            (1 5 4 0) //bottom left x=0;1 and y=0
	    (8 9 11 10) //left outlet x=2 plane
            (3 7 6 2)  //x=0 and x=1 (top y plane y=1)
	    (2 6 11 9) //x=1 and x=2 (top y plane y=1)

        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3) //x=0
        );
    }
    plate
    {
        type wall;
        faces
        (
            (1 8 10 5) //x=1;2 and y=0
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1) //x=0;1 and z=0
            (4 5 6 7) //x=0;1 and z=0.1
	    (1 2 9 8) //x=1;2 and z=0
	    (5 10 11 6) //x=1;2 and z=0.1
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
